{
  "Teamwork & Collaboration": [
    "Describe a time when you worked on a team project. What was your role?",
    "Tell me about a time when you had to collaborate with a difficult team member. How did you handle it?",
    "Can you provide an example of a time you contributed to the success of a group?"
  ],
  "Problem-Solving & Critical Thinking": [
    "Tell me about a time when you had to solve a challenging problem at work.",
    "Describe a situation where you had limited information but had to make a decision.",
    "Can you tell me about a time when you came up with a creative solution to a problem?"
  ],
  "Leadership & Initiative": [
    "Describe a time when you took initiative to address a problem or improve a process.",
    "Tell me about a time when you had to lead a project. How did you ensure success?",
    "Give an example of how you motivated a team to achieve a goal."
  ],
  "Time Management & Prioritization": [
    "How do you prioritize tasks when you have multiple deadlines to meet?",
    "Describe a time when you had to manage competing priorities.",
    "Can you provide an example of when you had to adjust your schedule due to unforeseen circumstances?"
  ],
  "Adaptability & Flexibility": [
    "Tell me about a time when you had to adapt to a significant change at work.",
    "Describe a situation where you had to quickly adjust to new information or conditions.",
    "Can you provide an example of when you had to learn something new on the job?"
  ],
  "Communication Skills": [
    "Tell me about a time when you had to explain a complex concept to a colleague or client.",
    "Give an example of how you've handled a miscommunication in the workplace.",
    "Describe a time when you had to persuade someone to see your point of view."
  ],
  "Conflict Resolution": [
    "Tell me about a time when you had to resolve a conflict between two team members.",
    "Describe a situation where you had to mediate a disagreement at work.",
    "Can you give an example of how you resolved a conflict with a colleague or supervisor?"
  ],
  "Work Ethic & Responsibility": [
    "Describe a time when you went above and beyond to meet a deadline or exceed expectations.",
    "Tell me about a situation where you had to take responsibility for a failure or mistake.",
    "Give an example of a time when you had to manage a heavy workload. How did you handle it?"
  ],
  "Failure & Resilience": [
    "Tell me about a time when you failed to meet a goal. How did you handle it?",
    "Describe a situation where you faced a significant setback at work.",
    "Share a time when you experienced a failure and how you bounced back."
  ],
  "Customer & Client Focus": [
    "Tell me about a time when you had to manage a difficult customer or client situation.",
    "Describe a situation where you had to go above and beyond to meet a client's needs.",
    "Can you provide an example of when you handled a customer complaint? What was the outcome?"
  ]
}
